_orgs/_posts/2018-01-27-http-error.org
#+TITLE:    HTTP 错误代码表
#+AUTHOR:   Rengui Zhao
#+EMAIL:    zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:16pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+BEGIN_EXPORT HTML
---
layout: post
title: HTTP 错误代码释义表
author: zrg
comments: false
description: HTTP error
categories:
- network
tags:
- HTTP
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* 2xx：成功
|------+--------------------------------------------------------------|
| Code | Description                                                  |
|------+--------------------------------------------------------------|
|  200 | 正常：请求已完成。                                           |
|  201 | 正常：请求成功并且服务器创建了新的资源。                     |
|  202 | 正常：服务器已接受请求，但尚未处理。                         |
|  203 | 正常：服务器已成功处理了请求，但返回的信息可能来自另一来源。 |
|  204 | 正常：服务器成功处理了请求，但没有返回任何内容。             |
|  205 | 正常：服务器成功处理了请求，但没有返回任何内容。             |
|  206 | 正常：服务器成功处理了部分 GET 请求。                        |
|------+--------------------------------------------------------------|
* 3xx：重定向
|------+-----------------------------------------------------------------------------|
| Code | Description                                                                 |
|------+-----------------------------------------------------------------------------|
|  301 | 已移动 — 请求的数据具有新的位置且更改是永久的。                             |
|  302 | 已找到 — 请求的数据临时具有不同 URI。                                       |
|  303 | 请参阅其它 — 可在另一 URI 下找到对请求的响应，且应使用 GET 方法检索此响应。 |
|  304 | 未修改 — 未按预期修改文档。                                                 |
|  305 | 使用代理 — 必须通过位置字段中提供的代理来访问请求的资源。                   |
|  306 | 未使用 — 不再使用；保留此代码以便将来使用。                                 |
|------+-----------------------------------------------------------------------------|
* 4xx：客户端出现的错误
表1：
|------+-------------------------------------------------------------------------------|
| Code | Descriptiono                                                                  |
|------+-------------------------------------------------------------------------------|
|  400 | 错误请求 — 请求中有语法问题，或不能满足请求。                                 |
|  401 | 请求要求身份验证。 对于需要登录的网页，服务器可能返回此响应。                 |
|  402 | 需要付款 — 表示计费系统已有效。                                               |
|  403 | 禁止 — 服务器拒绝请求。                                                       |
|  404 | 未找到 — 服务器找不到请求的网页。                                             |
|  405 | 禁用 — 禁用请求中指定的方法。                                    |
|  406 | 不接受 — 无法使用请求的内容特性响应请求的网页。         |
|  407 | 需要代理授权 — 此状态代码与 401（未授权）类似，但指定请求者应当授权使用代理。 |
|  408 | 请求超时 — 服务器等候请求时发生超时。                        |
|  409 | 冲突 — 服务器在完成请求时发生冲突。 服务器必须在响应中包含有关冲突的信息。 |
|  410 | 已删除 — 如果请求的资源已永久删除，服务器就会返回此响应。 |
|  411 | 需要有效长度 — 服务器不接受不含有效内容长度标头字段的请求。 |
|  412 | 未满足前提条件 — 服务器未满足请求者在请求中设置的其中一个前提条件。 |
|  413 | 请求实体过大 — 服务器无法处理请求，因为请求实体过大，超出服务器的处理能力。 |
|  414 | 请求的 URI 过长 — 请求的 URI（通常为网址）过长，服务器无法处理。 |
|  415 | 不支持的媒体类型 — 请求的格式不受请求页面的支持。      |
|  416 | 请求范围不符合要求 — 如果页面无法提供请求的范围，则服务器会返回此状态代码。 |
|  417 | 未满足期望值 — >服务器未满足”期望”请求标头字段的要求。 |
|------+-------------------------------------------------------------------------------|
表2：
|--------+----------------------------------------|
|   Code | Description                            |
|--------+----------------------------------------|
|  401.1 | 未授权：登录失败                       |
|  401.2 | 未授权：服务器配置问题导致登录失败     |
|  401.3 | ACL 禁止访问资源                       |
|  401.4 | 未授权：授权被筛选器拒绝               |
|  401.5 | 未授权：ISAPI 或 CGI 授权失败          |
|--------+----------------------------------------|
|  403.1 | 禁止访问：禁止可执行访问               |
|  403.2 | 禁止访问：禁止读访问                   |
|  403.3 | 禁止访问：禁止写访问                   |
|  403.4 | 禁止访问：要求 SSL                     |
|  403.5 | 禁止访问：要求 SSL 128                 |
|  403.6 | 禁止访问：IP 地址被拒绝                |
|  403.7 | 禁止访问：要求客户证书                 |
|  403.8 | 禁止访问：禁止站点访问                 |
|  403.9 | 禁止访问：连接的用户过多               |
| 403.10 | 禁止访问：配置无效                     |
| 403.11 | 禁止访问：密码更改                     |
| 403.12 | 禁止访问：映射器拒绝访问               |
| 403.13 | 禁止访问：客户证书已被吊销             |
| 403.15 | 禁止访问：客户访问许可过多             |
| 403.16 | 禁止访问：客户证书不可信或者无效       |
| 403.17 | 禁止访问：客户证书已经到期或者尚未生效 |
|--------+----------------------------------------|
|  404.1 | 无法找到 Web 站点                      |
|--------+----------------------------------------|
* 5xx：服务端出现的错误
|------+------------------------------------------------------------------------------------------|
| Code | Description                                                                              |
|------+------------------------------------------------------------------------------------------|
|  500 | 服务器内部错误 — 服务器遇到错误，无法完成请求。                                          |
|  501 | 尚未实施 — 服务器不具备完成请求的功能。 例如，服务器无法识别请求方法时可能会返回此代码。 |
|  502 | 错误网关 — 服务器作为网关或代理，从上游服务器收到无效响应。                              |
|  503 | 服务不可用 — 服务器目前无法使用（由于超载或停机维护）。 通常，这只是暂时状态。           |
|  504 | 网关超时 — 服务器作为网关或代理，但是没有及时从上游服务器收到请求。                      |
|  505 | HTTP 版本不受支持 — 服务器不支持请求中所用的 HTTP 协议版本。                                                                                      |
|------+------------------------------------------------------------------------------------------|

