_posts/2018-01-27-http-error.html
---
layout: post
title: HTTP 错误代码释义表
author: zrg
comments: false
description: HTTP error
categories:
- network
tags:
- HTTP
photos:
---

<div id="outline-container-org132fd1f" class="outline-2">
<h2 id="org132fd1f">2xx：成功</h2>
<div class="outline-text-2" id="text-org132fd1f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">200</td>
<td class="org-left">正常：请求已完成。</td>
</tr>

<tr>
<td class="org-right">201</td>
<td class="org-left">正常：请求成功并且服务器创建了新的资源。</td>
</tr>

<tr>
<td class="org-right">202</td>
<td class="org-left">正常：服务器已接受请求，但尚未处理。</td>
</tr>

<tr>
<td class="org-right">203</td>
<td class="org-left">正常：服务器已成功处理了请求，但返回的信息可能来自另一来源。</td>
</tr>

<tr>
<td class="org-right">204</td>
<td class="org-left">正常：服务器成功处理了请求，但没有返回任何内容。</td>
</tr>

<tr>
<td class="org-right">205</td>
<td class="org-left">正常：服务器成功处理了请求，但没有返回任何内容。</td>
</tr>

<tr>
<td class="org-right">206</td>
<td class="org-left">正常：服务器成功处理了部分 GET 请求。</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org91e3907" class="outline-2">
<h2 id="org91e3907">3xx：重定向</h2>
<div class="outline-text-2" id="text-org91e3907">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">301</td>
<td class="org-left">已移动 — 请求的数据具有新的位置且更改是永久的。</td>
</tr>

<tr>
<td class="org-right">302</td>
<td class="org-left">已找到 — 请求的数据临时具有不同 URI。</td>
</tr>

<tr>
<td class="org-right">303</td>
<td class="org-left">请参阅其它 — 可在另一 URI 下找到对请求的响应，且应使用 GET 方法检索此响应。</td>
</tr>

<tr>
<td class="org-right">304</td>
<td class="org-left">未修改 — 未按预期修改文档。</td>
</tr>

<tr>
<td class="org-right">305</td>
<td class="org-left">使用代理 — 必须通过位置字段中提供的代理来访问请求的资源。</td>
</tr>

<tr>
<td class="org-right">306</td>
<td class="org-left">未使用 — 不再使用；保留此代码以便将来使用。</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4df1fbd" class="outline-2">
<h2 id="org4df1fbd">4xx：客户端出现的错误</h2>
<div class="outline-text-2" id="text-org4df1fbd">
<p>
表1：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Code</th>
<th scope="col" class="org-left">Descriptiono</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">400</td>
<td class="org-left">错误请求 — 请求中有语法问题，或不能满足请求。</td>
</tr>

<tr>
<td class="org-right">401</td>
<td class="org-left">请求要求身份验证。 对于需要登录的网页，服务器可能返回此响应。</td>
</tr>

<tr>
<td class="org-right">402</td>
<td class="org-left">需要付款 — 表示计费系统已有效。</td>
</tr>

<tr>
<td class="org-right">403</td>
<td class="org-left">禁止 — 服务器拒绝请求。</td>
</tr>

<tr>
<td class="org-right">404</td>
<td class="org-left">未找到 — 服务器找不到请求的网页。</td>
</tr>

<tr>
<td class="org-right">405</td>
<td class="org-left">禁用 — 禁用请求中指定的方法。</td>
</tr>

<tr>
<td class="org-right">406</td>
<td class="org-left">不接受 — 无法使用请求的内容特性响应请求的网页。</td>
</tr>

<tr>
<td class="org-right">407</td>
<td class="org-left">需要代理授权 — 此状态代码与 401（未授权）类似，但指定请求者应当授权使用代理。</td>
</tr>

<tr>
<td class="org-right">408</td>
<td class="org-left">请求超时 — 服务器等候请求时发生超时。</td>
</tr>

<tr>
<td class="org-right">409</td>
<td class="org-left">冲突 — 服务器在完成请求时发生冲突。 服务器必须在响应中包含有关冲突的信息。</td>
</tr>

<tr>
<td class="org-right">410</td>
<td class="org-left">已删除 — 如果请求的资源已永久删除，服务器就会返回此响应。</td>
</tr>

<tr>
<td class="org-right">411</td>
<td class="org-left">需要有效长度 — 服务器不接受不含有效内容长度标头字段的请求。</td>
</tr>

<tr>
<td class="org-right">412</td>
<td class="org-left">未满足前提条件 — 服务器未满足请求者在请求中设置的其中一个前提条件。</td>
</tr>

<tr>
<td class="org-right">413</td>
<td class="org-left">请求实体过大 — 服务器无法处理请求，因为请求实体过大，超出服务器的处理能力。</td>
</tr>

<tr>
<td class="org-right">414</td>
<td class="org-left">请求的 URI 过长 — 请求的 URI（通常为网址）过长，服务器无法处理。</td>
</tr>

<tr>
<td class="org-right">415</td>
<td class="org-left">不支持的媒体类型 — 请求的格式不受请求页面的支持。</td>
</tr>

<tr>
<td class="org-right">416</td>
<td class="org-left">请求范围不符合要求 — 如果页面无法提供请求的范围，则服务器会返回此状态代码。</td>
</tr>

<tr>
<td class="org-right">417</td>
<td class="org-left">未满足期望值 — &gt;服务器未满足”期望”请求标头字段的要求。</td>
</tr>
</tbody>
</table>
<p>
表2：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">401.1</td>
<td class="org-left">未授权：登录失败</td>
</tr>

<tr>
<td class="org-right">401.2</td>
<td class="org-left">未授权：服务器配置问题导致登录失败</td>
</tr>

<tr>
<td class="org-right">401.3</td>
<td class="org-left">ACL 禁止访问资源</td>
</tr>

<tr>
<td class="org-right">401.4</td>
<td class="org-left">未授权：授权被筛选器拒绝</td>
</tr>

<tr>
<td class="org-right">401.5</td>
<td class="org-left">未授权：ISAPI 或 CGI 授权失败</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">403.1</td>
<td class="org-left">禁止访问：禁止可执行访问</td>
</tr>

<tr>
<td class="org-right">403.2</td>
<td class="org-left">禁止访问：禁止读访问</td>
</tr>

<tr>
<td class="org-right">403.3</td>
<td class="org-left">禁止访问：禁止写访问</td>
</tr>

<tr>
<td class="org-right">403.4</td>
<td class="org-left">禁止访问：要求 SSL</td>
</tr>

<tr>
<td class="org-right">403.5</td>
<td class="org-left">禁止访问：要求 SSL 128</td>
</tr>

<tr>
<td class="org-right">403.6</td>
<td class="org-left">禁止访问：IP 地址被拒绝</td>
</tr>

<tr>
<td class="org-right">403.7</td>
<td class="org-left">禁止访问：要求客户证书</td>
</tr>

<tr>
<td class="org-right">403.8</td>
<td class="org-left">禁止访问：禁止站点访问</td>
</tr>

<tr>
<td class="org-right">403.9</td>
<td class="org-left">禁止访问：连接的用户过多</td>
</tr>

<tr>
<td class="org-right">403.10</td>
<td class="org-left">禁止访问：配置无效</td>
</tr>

<tr>
<td class="org-right">403.11</td>
<td class="org-left">禁止访问：密码更改</td>
</tr>

<tr>
<td class="org-right">403.12</td>
<td class="org-left">禁止访问：映射器拒绝访问</td>
</tr>

<tr>
<td class="org-right">403.13</td>
<td class="org-left">禁止访问：客户证书已被吊销</td>
</tr>

<tr>
<td class="org-right">403.15</td>
<td class="org-left">禁止访问：客户访问许可过多</td>
</tr>

<tr>
<td class="org-right">403.16</td>
<td class="org-left">禁止访问：客户证书不可信或者无效</td>
</tr>

<tr>
<td class="org-right">403.17</td>
<td class="org-left">禁止访问：客户证书已经到期或者尚未生效</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">404.1</td>
<td class="org-left">无法找到 Web 站点</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge7c5b5c" class="outline-2">
<h2 id="orge7c5b5c">5xx：服务端出现的错误</h2>
<div class="outline-text-2" id="text-orge7c5b5c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">500</td>
<td class="org-left">服务器内部错误 — 服务器遇到错误，无法完成请求。</td>
</tr>

<tr>
<td class="org-right">501</td>
<td class="org-left">尚未实施 — 服务器不具备完成请求的功能。 例如，服务器无法识别请求方法时可能会返回此代码。</td>
</tr>

<tr>
<td class="org-right">502</td>
<td class="org-left">错误网关 — 服务器作为网关或代理，从上游服务器收到无效响应。</td>
</tr>

<tr>
<td class="org-right">503</td>
<td class="org-left">服务不可用 — 服务器目前无法使用（由于超载或停机维护）。 通常，这只是暂时状态。</td>
</tr>

<tr>
<td class="org-right">504</td>
<td class="org-left">网关超时 — 服务器作为网关或代理，但是没有及时从上游服务器收到请求。</td>
</tr>

<tr>
<td class="org-right">505</td>
<td class="org-left">HTTP 版本不受支持 — 服务器不支持请求中所用的 HTTP 协议版本。</td>
</tr>
</tbody>
</table>
</div>
</div>
